Autodesk.Revit.DB.Lighting.LightType.SetLossFactor(Autodesk.Revit.DB.Lighting.LossFactor)
Replace the current loss factor object with the given object
Remarks:
The argument object is cloned
lossFactor:
An object derived from a LossFactor object
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightType.GetLossFactor
Return a copy of an object derived from LossFactor
Since:
2013

Autodesk.Revit.DB.Lighting.LightType.SetInitialIntensity(Autodesk.Revit.DB.Lighting.InitialIntensity)
Replace the current initial intensity object with the given object
Remarks:
The argument object is cloned
initialIntensity:
An object derived from an InitialIntensity object
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightType.GetInitialIntensity
Return a copy of an object derived from InitialIntensity
Since:
2013

Autodesk.Revit.DB.Lighting.LightType.SetInitialColor(Autodesk.Revit.DB.Lighting.InitialColor)
Replace the current initial color object with the given object
Remarks:
The argument object is cloned
initialColor:
An object derived from an InitialColor object
The object pointed to is cloned internally
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightType.GetInitialColor
Return a copy of an object derived from InitialColor
Since:
2013

Autodesk.Revit.DB.Lighting.LightType.SetLightDistribution(Autodesk.Revit.DB.Lighting.LightDistribution)
Replace the current LightDistribution object with the given object
Remarks:
The argument object is cloned
Light distribution is a family element parameter. All other LightType properties and methods except for light shape are
family type parameters. Changes to family type parameters may not be committed in the same transaction with changes to
family element parameters, otherwise the modifications to the family type may be lost. Always use a separate transaction
for changes to the shape and distribution of a light.
lightDistribution:
An instance of an object derived from LightDistribution
Throws Autodesk.Revit.Exceptions.ArgumentException:
The LightDistribution is the argument that is being validated
The LightDistribution is not valid because it of a different derived type than the current LightDistribution derived type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightType.GetLightDistribution
Return a copy of an object derived from LightDistribution
Since:
2013

Autodesk.Revit.DB.Lighting.LightType.SetLightShape(Autodesk.Revit.DB.Lighting.LightShape)
Replace the current LightShape object with the given object
Remarks:
The argument object is cloned.
Light shape is a family element parameter. All other LightType properties and methods except for light distribution are
family type parameters. Changes to family type parameters may not be committed in the same transaction with changes to
family element parameters, otherwise the modifications to the family type may be lost. Always use a separate transaction
for changes to the shape and distribution of a light.
lightShape:
An instance of an object derived from LightShape
Throws Autodesk.Revit.Exceptions.ArgumentException:
The LightShape is the argument that is being validated
The LightShape is not valid because it of a different derived type than the current LightShape derived type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightType.GetLightShape
Return a copy of an object derived from LightShape
Since:
2013

Autodesk.Revit.DB.Lighting.LightType.GetLightTypeFromInstance(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a light type object from the given document and element ID
document:
The document the instanceId is from
instanceId:
The ID of the light fixture instance
Returns:
The newly created LightType object
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId is the argument that is being validated
The ElementId is not valid because it is not for a light element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightType.GetLightType(Autodesk.Revit.DB.Document,Autodesk.Revit.DB.ElementId)
Creates a light type object from the given document and family type ID
document:
The document the typeId is from
typeId:
The ID of the light family type
Returns:
The newly created LightType object
Throws Autodesk.Revit.Exceptions.ArgumentException:
The ElementId is the argument that is being validated
The ElementId is not valid because it is not for a light element.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightType.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Lighting.LightType.DimmingColor
The dimming temperature value in Kelvins.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration
Since:
2013

Autodesk.Revit.DB.Lighting.LightType.ColorFilter
The light filter color.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Since:
2013

Autodesk.Revit.DB.Lighting.LightType
This class encapsulates light information.
Since:
2013